//! завдання 1)

//! завдання 2)

//! завдання 3)

//! завдання 4)

//! завдання 5)

//! завдання 6)

//! завдання 7)

//! завдання 8)

//! завдання 9)

//! завдання 10)

//! завдання 11)

//! завдання 12)

//! завдання 13)

//! завдання 14)

//! завдання 15)

//! завдання 16)

//! завдання 17)

//! завдання 18)

//! завдання 19)

//! завдання 20)

//! завдання 21)

//! завдання 22)

//! завдання 23)

//! завдання 24)

//! завдання 25)

//! завдання 26)

//! завдання 27)

//! завдання 28)

//! завдання 29)

//! завдання 30)

//! завдання 31)

//! завдання 32)

//! завдання 33)

//! завдання 34)

//! завдання 35)

//! завдання 36)

//! завдання 37)

//! завдання 38)

//! завдання 39)

//! завдання 40)

//! завдання 41)

//! завдання 42)
